NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/variants/mduino/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

#define NUM_DIGITAL_PINS            70
#define NUM_ANALOG_INPUTS           16
#define analogInputToDigitalPin(p)  ((p < 16) ? (p) + 54 : -1)
#define digitalPinHasPWM(p)         (((p) >= 2 && (p) <= 13) || ((p) >= 44 && (p)<= 46))

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO inputs
#define PIN_I0_0		(22)
#define PIN_I0_1		(23)
#define PIN_I0_2		(24)
#define PIN_I0_3		(25)
#define PIN_I0_4		(26)
#define PIN_I0_5		(2)
#define PIN_I0_6		(3)
#define PIN_I0_7		(54)
#define PIN_I0_8		(55)
#define PIN_I0_9		(56)
#define PIN_I0_10		(57)
#define PIN_I0_11		(58)
#define PIN_I0_12		(59)
#define PIN_I1_0		(27)
#define PIN_I1_1		(28)
#define PIN_I1_2		(29)
#define PIN_I1_3		(30)
#define PIN_I1_4		(31)
#define PIN_I1_5		(18)
#define PIN_I1_6		(19)
#define PIN_I1_7		(60)
#define PIN_I1_8		(61)
#define PIN_I1_9		(62)
#define PIN_I1_10		(63)
#define PIN_I1_11		(64)
#define PIN_I1_12		(65)
#define PIN_I2_0		(32)
#define PIN_I2_1		(33)
#define PIN_I2_2		(34)
#define PIN_I2_3		(35)
#define PIN_I2_5		(20)
#define PIN_I2_6		(21)
#define PIN_I2_7		(66)
#define PIN_I2_8		(67)
#define PIN_I2_9		(68)
#define PIN_I2_10		(69)

#if defined(MDUINO_58) || defined(MDUINO_42) || defined(MDUINO_21)
static const uint8_t I0_0 = PIN_I0_0;
static const uint8_t I0_1 = PIN_I0_1;
static const uint8_t I0_2 = PIN_I0_2;
static const uint8_t I0_3 = PIN_I0_3;
static const uint8_t I0_4 = PIN_I0_4;
static const uint8_t I0_5 = PIN_I0_5;
static const uint8_t I0_6 = PIN_I0_6;
static const uint8_t I0_7 = PIN_I0_7;
static const uint8_t I0_8 = PIN_I0_8;
static const uint8_t I0_9 = PIN_I0_9;
static const uint8_t I0_10 = PIN_I0_10;
static const uint8_t I0_11 = PIN_I0_11;
static const uint8_t I0_12 = PIN_I0_12;
#endif
#if defined(MDUINO_58) || defined(MDUINO_42)
static const uint8_t I1_0 = PIN_I1_0;
static const uint8_t I1_1 = PIN_I1_1;
static const uint8_t I1_2 = PIN_I1_2;
static const uint8_t I1_3 = PIN_I1_3;
static const uint8_t I1_4 = PIN_I1_4;
static const uint8_t I1_5 = PIN_I1_5;
static const uint8_t I1_6 = PIN_I1_6;
static const uint8_t I1_7 = PIN_I1_7;
static const uint8_t I1_8 = PIN_I1_8;
static const uint8_t I1_9 = PIN_I1_9;
static const uint8_t I1_10 = PIN_I1_10;
static const uint8_t I1_11 = PIN_I1_11;
static const uint8_t I1_12 = PIN_I1_12;
#endif
#if defined(MDUINO_58)
static const uint8_t I2_0 = PIN_I2_0;
static const uint8_t I2_1 = PIN_I2_1;
static const uint8_t I2_2 = PIN_I2_2;
static const uint8_t I2_3 = PIN_I2_3;
static const uint8_t I2_5 = PIN_I2_5;
static const uint8_t I2_6 = PIN_I2_6;
static const uint8_t I2_7 = PIN_I2_7;
static const uint8_t I2_8 = PIN_I2_8;
static const uint8_t I2_9 = PIN_I2_9;
static const uint8_t I2_10 = PIN_I2_10;
#endif

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO digital outputs
#define PIN_Q0_0		(36)
#define PIN_Q0_1		(37)
#define PIN_Q0_2		(38)
#define PIN_Q0_3		(39)
#define PIN_Q0_4		(40)
#define PIN_Q0_5		(4)
#define PIN_Q0_6		(5)
#define PIN_Q0_7		(6)
#define PIN_Q1_0		(41)
#define PIN_Q1_1		(42)
#define PIN_Q1_2		(43)
#define PIN_Q1_3		(44)
#define PIN_Q1_4		(45)
#define PIN_Q1_5		(8)
#define PIN_Q1_6		(9)
#define PIN_Q1_7		(7)
#define PIN_Q2_0		(46)
#define PIN_Q2_1		(47)
#define PIN_Q2_2		(48)
#define PIN_Q2_3		(49)
#define PIN_Q2_5		(12)
#define PIN_Q2_6		(13)

#if defined(MDUINO_58) || defined(MDUINO_42) || defined(MDUINO_21)
static const uint8_t Q0_0 = PIN_Q0_0;
static const uint8_t Q0_1 = PIN_Q0_1;
static const uint8_t Q0_2 = PIN_Q0_2;
static const uint8_t Q0_3 = PIN_Q0_3;
static const uint8_t Q0_4 = PIN_Q0_4;
static const uint8_t Q0_5 = PIN_Q0_5;
static const uint8_t Q0_6 = PIN_Q0_6;
static const uint8_t Q0_7 = PIN_Q0_7;
#endif
#if defined(MDUINO_58) || defined(MDUINO_42)
static const uint8_t Q1_0 = PIN_Q1_0;
static const uint8_t Q1_1 = PIN_Q1_1;
static const uint8_t Q1_2 = PIN_Q1_2;
static const uint8_t Q1_3 = PIN_Q1_3;
static const uint8_t Q1_4 = PIN_Q1_4;
static const uint8_t Q1_5 = PIN_Q1_5;
static const uint8_t Q1_6 = PIN_Q1_6;
static const uint8_t Q1_7 = PIN_Q1_7;
#endif
#if defined(MDUINO_58)
static const uint8_t Q2_0 = PIN_Q2_0;
static const uint8_t Q2_1 = PIN_Q2_1;
static const uint8_t Q2_2 = PIN_Q2_2;
static const uint8_t Q2_3 = PIN_Q2_3;
static const uint8_t Q2_5 = PIN_Q2_5;
static const uint8_t Q2_6 = PIN_Q2_6;
#endif

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO analog outputs
#define PIN_A0_5		PIN_Q0_5
#define PIN_A0_6		PIN_Q0_6
#define PIN_A0_7		PIN_Q0_7
#define PIN_A1_5		PIN_Q1_5
#define PIN_A1_6		PIN_Q1_6
#define PIN_A1_7		PIN_Q1_7
#define PIN_A2_5		PIN_Q2_5
#define PIN_A2_6		PIN_Q2_6

#if defined(MDUINO_58) || defined(MDUINO_42) || defined(MDUINO_21)
static const uint8_t A0_5 = PIN_A0_5;
static const uint8_t A0_6 = PIN_A0_6;
static const uint8_t A0_7 = PIN_A0_7;
#endif
#if defined(MDUINO_58) || defined(MDUINO_42)
static const uint8_t A1_5 = PIN_A1_5;
static const uint8_t A1_6 = PIN_A1_6;
static const uint8_t A1_7 = PIN_A1_7;
#endif
#if defined(MDUINO_58)
static const uint8_t A2_5 = PIN_A2_5;
static const uint8_t A2_6 = PIN_A2_6;
#endif

